[{"type":"heading","attrs":{"level":1,"id":"latar-belakang"},"content":[{"type":"text","text":"penduhuluan"}]},{"type":"heading","attrs":{"level":2,"id":"md44k1r1esmhho"},"content":[{"type":"text","marks":[{"type":"bold"}],"text":"Latar Belakang"}]},{"type":"paragraph","content":[{"type":"text","text":"LaTeX telah menjadi standar de facto dalam penulisan dokumen ilmiah, terutama di bidang akademik dan riset. Kemampuannya dalam menghasilkan dokumen dengan tipografi yang konsisten dan dukungan kuat terhadap formula matematika menjadikannya pilihan utama untuk penulisan karya ilmiah, skripsi, tesis, dan jurnal. Namun, proses penulisan LaTeX yang mengandalkan sintaksis berbasis teks membuatnya kurang ramah bagi pengguna awam. Banyak mahasiswa, khususnya yang tidak memiliki latar belakang dalam pemrograman atau markup language, mengalami kesulitan saat harus menulis dokumen ilmiah menggunakan LaTeX."}]},{"type":"paragraph","content":[{"type":"text","text":"Seiring perkembangan teknologi antarmuka pengguna (UI\/UX), pendekatan visual dalam pengolahan dokumen mulai banyak digunakan. Editor seperti Google Docs atau Microsoft Word telah membiasakan pengguna dengan sistem "},{"type":"text","marks":[{"type":"italic"}],"text":"what-you-see-is-what-you-get"},{"type":"text","text":" (WYSIWYG), namun keduanya belum mampu memberikan kualitas output yang setara dengan LaTeX untuk dokumen ilmiah, khususnya dalam hal layout matematika dan pengaturan sitasi."}]},{"type":"paragraph","content":[{"type":"text","text":"Untuk menjembatani kebutuhan akan kemudahan penggunaan dan kualitas output, dikembangkanlah HighTex, sebuah document editor berbasis web yang memungkinkan pengguna menulis dokumen ilmiah tanpa harus menulis kode LaTeX secara langsung. HighTex tidak mengonversi input pengguna ke format LaTeX secara real-time, namun dirancang sebagai "},{"type":"text","marks":[{"type":"bold"}],"text":"pengganti proses manual LaTeX"},{"type":"text","text":" dengan pengalaman visual yang intuitif, terstruktur, dan sesuai standar akademik."}]},{"type":"heading","attrs":{"level":2,"id":"md44k1r1esmhho"},"content":[{"type":"text","marks":[{"type":"bold"}],"text":"Rumusan Masalah"}]},{"type":"paragraph","content":[{"type":"text","text":"Berdasarkan latar belakang tersebut, rumusan masalah yang diangkat adalah:"}]},{"type":"orderedList","attrs":{"start":1},"content":[{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Bagaimana merancang sistem editor dokumen ilmiah yang mudah digunakan tanpa memerlukan pengetahuan LaTeX?"}]}]},{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Bagaimana menyusun arsitektur sistem agar pengguna dapat membuat dokumen akademik terstruktur secara visual?"}]}]},{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Bagaimana memastikan bahwa hasil akhir dokumen tetap sesuai dengan standar akademik walau tidak ditulis dalam LaTeX?"}]}]}]},{"type":"heading","attrs":{"level":2,"id":"md44k1r1esmhho"},"content":[{"type":"text","marks":[{"type":"bold"}],"text":"Tujuan"}]},{"type":"paragraph","content":[{"type":"text","text":"Tujuan dari pengembangan HighTex adalah:"}]},{"type":"bulletList","content":[{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Mengembangkan editor dokumen ilmiah berbasis web yang dapat menggantikan penulisan manual menggunakan LaTeX."}]}]},{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Memberikan pengalaman menulis dokumen yang mudah, cepat, dan tetap menjaga struktur akademik."}]}]},{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Menyediakan fitur visual seperti manajemen sitasi, penomoran otomatis, tabel, daftar isi, dan rumus matematika tanpa harus menulis kode LaTeX."}]}]}]},{"type":"heading","attrs":{"level":2,"id":"md44k1r1esmhho"},"content":[{"type":"text","marks":[{"type":"bold"}],"text":"Manfaat"}]},{"type":"paragraph","content":[{"type":"text","text":"Manfaat dari penelitian dan pengembangan ini antara lain:"}]},{"type":"bulletList","content":[{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Membantu mahasiswa dan penulis akademik dalam menyusun dokumen tanpa harus mempelajari LaTeX."}]}]},{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Meningkatkan efisiensi dan akurasi dalam pembuatan dokumen ilmiah."}]}]},{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Menyediakan alternatif baru dalam penulisan akademik berbasis web."}]}]}]},{"type":"heading","attrs":{"level":2,"id":"md44k1r1esmhho"},"content":[{"type":"text","marks":[{"type":"bold"}],"text":"Ruang Lingkup"}]},{"type":"paragraph","content":[{"type":"text","text":"Ruang lingkup dari sistem HighTex ini mencakup:"}]},{"type":"bulletList","content":[{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Penggunaan editor berbasis web dengan antarmuka WYSIWYG."}]}]},{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Dukungan terhadap struktur dokumen akademik: judul, bab, subbab, daftar pustaka, tabel, gambar, dan formula matematika."}]}]},{"type":"listItem","content":[{"type":"paragraph","content":[{"type":"text","text":"Tidak mencakup integrasi langsung dengan compiler LaTeX seperti pdflatex, melainkan fokus pada pengalaman penulisan dan ekspor dokumen ke format akhir (PDF atau dokumen struktural lainnya)."}]}]}]}]